app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 101) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 101)
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO "users" ("updated_at", "name", "admin", "created_at", "encrypted_password", "email", "salt") VALUES ('2011-06-27 23:36:23.980814', 'Emily Traynor', 'f', '2011-06-27 23:36:23.980814', '9e6084240e928611422f503b8652ac077dbb04543a9803c40247f14aedff801f', 'EmilyTraynor@gmail.com', '84345a79b86da7dac7b386a7f669eb7030a3211953b71ae2b9347ccc9dc0bdab')
---
  def create
    @user = User.new(params[:user])
    if signed_in?
      redirect_to(root_path)
    else
      if @user.save

UPDATE "users" SET "updated_at" = '2011-06-24 18:47:08.601512', "email" = 'user@example.org', "encrypted_password" = 'c5b46b01ddc3406e71c4880914af187d7f5605636af98bc13246cf6a5c58c32f', "name" = 'New Name' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])

DELETE FROM "users" WHERE "users"."id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy